# Prerequisites
tap "homebrew/dupes"
tap "caskroom/cask"
tap "neovim/neovim"

brew "cmake"
brew "elixir"
brew "exercism"
brew "vim"
brew "neovim"
brew "macvim"
brew "mongodb"
brew "python"
brew "redis"
brew "sbt"
brew "scala"
brew "the_silver_searcher"
brew "direnv"
brew "tmux"

cask "1password"
cask "chitchat"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "java"
cask "skype"
cask "slack"
cask "telegram"
cask "the-unarchiver"
cask "vlc"
