# Prerequisites
tap "homebrew/dupes"
tap "caskroom/cask"
tap "neovim/neovim"
tap "homebrew/python"
tap "homebrew/science"
# tap monzo/tap git@github.com:monzo/tap.git

# Must be installed first
cask "java"

brew "awscli"
brew "cmake"
brew "ctags"
brew "direnv"
brew "elasticsearch"
brew "elixir"
brew "exercism"
brew "git"
brew "gnupg2"
brew "go"
brew "gpg-agent"
brew "kubectl"
brew "macvim"
brew "magic-wormhole"
brew "matplotlib"
brew "mongodb"
brew "neovim"
brew "node"
brew "numpy"
brew "python"
brew "python3"
brew "reattach-to-user-namespace"
brew "redis"
brew "sbt"
brew "scala"
brew "scipy"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "yarn"
brew "z"
brew "zsh"

cask "1password"
cask "chitchat"
cask "firefox"
cask "franz"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "skype"
cask "slack"
cask "telegram"
cask "the-unarchiver"
cask "vlc"
